// Room: /u/o/oldsix/room/xbdt.c

inherit ROOM;

void create()
{
set("short","ËÕÖÝ¸®´óÌÃ");
	set("long", @LONG
ÕâÀï¾ÍÊÇËÕÖÝ¸®µÄ¿ØÖÆÖÐÊà£¬ÈÎºÎÒ»µÀÃüÁî¶¼ÊÇÓÉÕâ¶ù·¢³öµÄ¡£ÓÉÓÚËüµÄ
ÖØÒªÐÔ£¬ÍâÈËÊÇ²»¿ÉËæÒâ½ø³öÕâµÄ¡£¾«×³µÄÑÃÒÛ·ÖÁ¢Á½Ïá£¬Õýµ±ÖÐÒ»ÕÅºìÄ¾×À
ºó×ø×ÅÒ»ÖÐÄêÈåÉú£¬ÃæÉ«Òõ³Á¡£×À±ßÊú×ÅÒ»¿é[1;32mÅÆ×Ó[2;37;0m£¬ÉÏÃæºÃÏóÐ´×ÅÊ²Ã´¡£
LONG
	);
	set("item_desc",([
		"ÅÆ×Ó" :
"           ËÕÖÝ¸®¸æ×´(gao)·ÑÓÃÒ»ÀÀ±í\n"+
"__________________________________________________\n\n"+
"       ÉêÇëÈýºÅÍ¨¼©Áî£¬Ðè½ÉÄÉÊÖÐø·ÑÊ®Á½°×Òø¡£\n"+
"       ÉêÇë¶þºÅÍ¨¼©Áî£¬Ðè½ÉÄÉÊÖÐø·ÑÒ»Á½»Æ½ð¡£\n"+
"       ÉêÇëÒ»ºÅÍ¨¼©Áî£¬Ðè½ÉÄÉÊÖÐø·ÑÎåÁ½»Æ½ð¡£\n"+
"¿¼ÂÇµ½ÈËµÀÖ÷ÒåµÄÔ­Ôò£¬±¾¸®ÔÝ·Ï³ýËÀÐÌ¡£ÊÕÈËÇ®²ÆÓëÈË\n"+
"ÏûÔÖ£¬²»²ÎÓëÍæ¼Ò¼äµÄ¶÷Ô©¡£±¾Í¨¸æ×ÔÕÅÌùÖ®ÈÕÆðÉúÐ§£¡\n"+
"__________________________________________________\n\n"+
"				¡¸ºÚÌì´óÀÏÒ¯¡¹Î§Ä³ \n"+
"                                          ºïÄêÂíÔÂ \n",
		"paizi":
"           ËÕÖÝ¸®¸æ×´(gao)·ÑÓÃÒ»ÀÀ±í\n"+
"__________________________________________________\n\n"+
"       ÉêÇëÈýºÅÍ¨¼©Áî£¬Ðè½ÉÄÉÊÖÐø·ÑÊ®Á½°×Òø¡£\n"+
"       ÉêÇë¶þºÅÍ¨¼©Áî£¬Ðè½ÉÄÉÊÖÐø·ÑÒ»Á½»Æ½ð¡£\n"+
"       ÉêÇëÒ»ºÅÍ¨¼©Áî£¬Ðè½ÉÄÉÊÖÐø·ÑÎåÁ½»Æ½ð¡£\n"+
"¿¼ÂÇµ½ÈËµÀÖ÷ÒåµÄÔ­Ôò£¬±¾¸®ÔÝ·Ï³ýËÀÐÌ¡£ÊÕÈËÇ®²ÆÓëÈË\n"+
"ÏûÔÖ£¬²»²ÎÓëÍæ¼Ò¼äµÄ¶÷Ô©¡£±¾Í¨¸æ×ÔÕÅÌùÖ®ÈÕÆðÉúÐ§£¡\n"+
"__________________________________________________\n\n"+
"                                ¡¸ºÚÌì´óÀÏÒ¯¡¹Î§Ä³ \n"+
"                                          ºïÄêÂíÔÂ \n",
			]));
	set("exits", ([ /* sizeof() == 1 */
	"west" :__DIR__"tangkou",
]));
	set("objects",([
		__DIR__"npc/weidaren":1,
]));
	set("no_fight",1);
	set("no_clean_up", 0);
	set("no_magic",1);
	set("no_steal",1);
	setup();
}
int valid_leave(object me,string dir)
{
	me->set_temp("oldsix_flag/money",0);
	return 1;
}
